20241104T093353--kdoc-271-動的型付け言語が機械語に変換しにくい理由を考える__permanent.org
:properties:
:ID: 20241104T093353
:mtime:    20250903220435
:ctime:    20241104093354
:end:
#+title:      KDOC 271: 動的型付け言語が機械語に変換しにくい理由を考える
#+date:       [2024-11-04 Mon 09:33]
#+filetags:   :permanent:
#+identifier: 20241104T093353

* この文書のステータス
- 作成
  - [X] 2024-11-04 貴島
- レビュー
  - [X] 2024-11-08 貴島

* 概要
機械語にコンパイルするときは、データ型を知る必要がある。アセンブリや機械語ではサイズを明確に指定する必要があるためだ。メモリ上のデータの位置関係を数値で示さなければならない。型は効率的にメモリへ詰めるため、必要になる。さらにCPU命令セットによってデータ型のサイズが異なるので、その差異を吸収するために型の情報が必要である。型情報がなければ効率的に変換できないから、動的型付け言語では機械語に変換しにくい。

* 関連
- [[id:20241104T091512][KDOC 270: 動的型付け言語ではなぜバイトコードにコンパイルすることが多いか?]]。メモリサイズの面から見た答え
