20241104T093353--kdoc-271-動的型付け言語が機械語に変換しにくい理由を考える__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:10:55Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 271: 動的型付け言語が機械語に変換しにくい理由を考える</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 271: 動的型付け言語が機械語に変換しにくい理由を考える</h1>
<div id="outline-container-org662aa4f" class="outline-2">
<h2 id="org662aa4f"><a href="#org662aa4f">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org662aa4f">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-04 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9d704e1" class="outline-2">
<h2 id="org9d704e1"><a href="#org9d704e1">概要</a></h2>
<div class="outline-text-2" id="text-org9d704e1">
<p>
機械語にコンパイルするときは、データ型を知る必要がある。アセンブリや機械語ではサイズを明確に指定する必要があるためだ。メモリ上のデータの位置関係を数値で示さなければならない。型は効率的にメモリへ詰めるため、必要になる。さらにCPU命令セットによってデータ型のサイズが異なるので、その差異を吸収するために型の情報が必要である。型情報がなければ効率的に変換できないから、動的型付け言語では機械語に変換しにくい。
</p>
</div>
</div>
<div id="outline-container-org0615a06" class="outline-2">
<h2 id="org0615a06"><a href="#org0615a06">関連</a></h2>
<div class="outline-text-2" id="text-org0615a06">
<ul class="org-ul">
<li><a href="20241104T091512--kdoc-270-動的型付け言語ではなぜバイトコードにコンパイルすることが多いか__permanent.html#ID-20241104T091512">KDOC 270: 動的型付け言語ではなぜバイトコードにコンパイルすることが多いか?</a>。メモリサイズの面から見た答え</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
